app/Controllers/Teacher/TeacherController.php

SELECT *
FROM `students`
---
    public function inputNilai()
    {
        $studentsModel = new StudentsModel();

        // Ambil semua data mahasiswa
        $students = $studentsModel->findAll();