app/Controllers/Admin/EditCourseController.php

SELECT *
FROM `courses`
---
    public function index()
    {
        $model = new CoursesModel();
        $data['courses'] = $model->findAll();