app/Controllers/AdminController.php

SELECT *
FROM `students`
---
    public function inputMahasiswaView()
    {
        $studentsModel = new StudentsModel();
        $students = $studentsModel->findAll();