app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'monic'
 LIMIT 1
---
    public function login()
    {
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Ambil user berdasarkan username
        $user = $model->where('username', $username)->first();