app/Controllers/Dashboard.php

SELECT *
FROM `students`
WHERE `students`.`id` = '2'
---
    public function mahasiswa()
    {
        $session = session();
        $username = $session->get('username');
        $id = $session->get('id');

        // Ambil data mahasiswa berdasarkan ID
        $studentsModel = new StudentsModel();
        $student = $studentsModel->find($id);