app/Controllers/Mahasiswa/IPController.php

    public function generatorView()
    {
        $coursesModel = new CoursesModel();
        $studentId = session()->get('id'); // ID mahasiswa dari session

        // Ambil mata kuliah yang diambil mahasiswa
        $courses = $coursesModel->select('courses.id, courses.course_name, courses.credits')
                                ->join('students_courses', 'students_courses.course_id = courses.id')
                                ->where('students_courses.student_id', $studentId)
                                ->findAll();
---
SELECT `courses`.`id`, `courses`.`course_name`, `courses`.`credits`
FROM `courses`
JOIN `students_courses` ON `students_courses`.`course_id` = `courses`.`id`
WHERE `students_courses`.`student_id` = '10'

    public function generateIP()
    {
        $grades = $this->request->getPost('grades');
        $totalCredits = 0;
        $totalWeightedGrade = 0;

        foreach ($grades as $courseId => $grade) {
            $course = (new CoursesModel())->find($courseId);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = 1