app/Controllers/Mahasiswa/JadwalController.php

    public function jadwalKuliah($studentId)
    {
        $studentsCoursesModel = new \App\Models\StudentsCoursesModel();

        // Ambil data jadwal mata kuliah berdasarkan mahasiswa
        $jadwal = $studentsCoursesModel
            ->where('students_courses.student_id', $studentId)
            ->join('courses', 'students_courses.course_id = courses.id')
            ->select('courses.course_name, courses.day, courses.start_time, courses.duration')
            ->findAll();
---
SELECT `courses`.`course_name`, `courses`.`day`, `courses`.`start_time`, `courses`.`duration`
FROM `students_courses`
JOIN `courses` ON `students_courses`.`course_id` = `courses`.`id`
WHERE `students_courses`.`student_id` = '18222090'