app/Controllers/Mahasiswa/PendaftaranController.php

    public function index()
    {
        $coursesModel = new CoursesModel();
        $courses = $coursesModel->findAll(); // Ambil semua data mata kuliah
---
SELECT *
FROM `courses`

    public function pilih()
    {
        $studentsCoursesModel = new StudentsCoursesModel();

        // Ambil ID mahasiswa dari session
        $studentId = session()->get('id');
        if (!$studentId) {
            return redirect()->back()->with('error', 'Anda belum login');
        }

        $courseId = $this->request->getPost('course_id');
        $semester = $this->request->getPost('semester');

        // Validasi data
        if (!$courseId || !$semester) {
            return redirect()->back()->with('error', 'Data tidak valid');
        }

        // Cek apakah mata kuliah sudah dipilih sebelumnya
        $exists = $studentsCoursesModel->where('student_id', $studentId)
            ->where('course_id', $courseId)
            ->first();
---
SELECT *
FROM `students_courses`
WHERE `student_id` = '10'
AND `course_id` = '3'
 LIMIT 1

            'semester' => $semester,
        ];

        if ($studentsCoursesModel->insert($data)) {
---
INSERT INTO `students_courses` (`student_id`, `course_id`, `semester`) VALUES ('10', '3', '4')