app/Controllers/Mahasiswa/ProfilController.php

    public function index($studentId)
    {

        $studentsModel = new StudentsModel();
        $studentsCoursesModel = new StudentsCoursesModel();
        $mataKuliah = new CoursesModel();

        // Ambil data mahasiswa
        $student = $studentsModel->find($studentId);

        if (!$student) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Mahasiswa tidak ditemukan'
            ])->setStatusCode(404);
        }

        // Ambil data mata kuliah yang dipilih mahasiswa
        $mataKuliah = $studentsCoursesModel
            ->where('students_courses.student_id', $studentId)
            ->join('courses', 'students_courses.course_id = courses.id')
            ->select('courses.id, courses.course_name, courses.day, courses.start_time, courses.duration, courses.credits, students_courses.semester')
            ->findAll();
---
SELECT `courses`.`id`, `courses`.`course_name`, `courses`.`day`, `courses`.`start_time`, `courses`.`duration`, `courses`.`credits`, `students_courses`.`semester`
FROM `students_courses`
JOIN `courses` ON `students_courses`.`course_id` = `courses`.`id`
WHERE `students_courses`.`student_id` = '18222074'